DataProcessors/дпУстановкаСоответсвияАппаратовМатрицы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>дпУстановкаСоответсвияАппаратовМатрицы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/дпСоответствиеМатриц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>дпСоответствиеМатриц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АппаратОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МатрицаАппаратов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АппаратКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МатрицаАппаратов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/дпУстановкаСоответсвияАппаратовМатрицы/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьСписокНаСервере()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(МатрицаАппаратов.Ссылка) КАК АппаратКлиента,
		|	МатрицаАппаратов.Наименование КАК АппаратКлиентаСтрока
		|ИЗ
		|	Справочник.МатрицаАппаратов КАК МатрицаАппаратов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.дпСоответствиеМатриц КАК дпСоответствиеМатриц
		|		ПО (дпСоответствиеМатриц.АппаратКлиента = МатрицаАппаратов.Ссылка)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА дпСоответствиеМатриц.АппаратОрганизации ЕСТЬ NULL 
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	И МатрицаАппаратов.Владелец <> &Владелец
		|	И ВЫБОР
		|			КОГДА &ОтборКлиент
		|				ТОГДА МатрицаАппаратов.Владелец = &Клиент
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	МатрицаАппаратов.Наименование";
	
	Запрос.УстановитьПараметр("Владелец", Справочники.Партнеры.НашеПредприятие);
	Запрос.УстановитьПараметр("ОтборКлиент", ЗначениеЗаполнено(Объект.Клиент));
	Запрос.УстановитьПараметр("Клиент", Объект.Клиент);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	ТаблицаСоотвествия.Загрузить(РезультатЗапроса);	
	

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияНаСервере(Отказ)
	НачатьТранзакцию();
	
	МассивВладельцев = Новый Массив;
	
	Для Каждого СтрокаСоотвествия из ТаблицаСоотвествия Цикл
		Если ЗначениеЗаполнено(СтрокаСоотвествия.АппаратКлиента)
			и ЗначениеЗаполнено(СтрокаСоотвествия.АппаратОрганизации) Тогда
			
			МенеджерЗаписи = РегистрыСведений.дпСоответствиеМатриц.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.АппаратКлиента 		= СтрокаСоотвествия.АппаратКлиента;
			МенеджерЗаписи.АппаратОрганизации 	= СтрокаСоотвествия.АппаратОрганизации;
			МенеджерЗаписи.Записать();
			
			//Если НЕ МассивВладельцев.Найти(СтрокаСоотвествия.АппаратКлиента.Владелец) Тогда
			//	МассивВладельцев.Добавить(СтрокаСоотвествия.АппаратКлиента.Владелец);
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	//Для Каждого Владелец из МассивВладельцев Цикл
		дп_ДополнительныеПроцедуры.УстановитьСоотвествиеМатриц();	
	//КонецЦикла;	
	
	Попытка
	
		ЗафиксироватьТранзакцию();
			
	Исключение
	    Отказ = Истина;
	КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	Отказ = Ложь;
	ЗаписатьИзмененияНаСервере(Отказ);
	Если Не Отказ Тогда
	    ПоказатьПредупреждение(Новый ОписаниеОповещения("ЗаписатьИзмененияЗавершение", ЭтотОбъект), "Данные записаны.");
	Иначе
	    ПоказатьПредупреждение(Неопределено, "Не удалось записать данные.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияЗавершение(ДополнительныеПараметры) Экспорт
	
	ОбновитьСписокНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	КлиентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КлиентПриИзмененииНаСервере()
	ОбновитьСписокНаСервере();
КонецПроцедуры
